                                   ASSIGNMENT: PANDAS ADVANCED

Q1. List any five functions of the pandas library with execution.

This is a list of the five functions form the Pandas lib;
1. head() 
2. tail()
3. describe()
4. Cetagorical
5. series()

let's execute each of them one by one,
we are using the data frame from quation 2 to expalin these functions

In [14]:
#head() ; this function is using for prining the first five elements of the data frame
df.head()

       A             B                           C
0  Rahul  Data Science  Deen Dayal Private limited
1   Rony       Web dev  Nathhu lal private limited

In [16]:
#tail() function is print the data from lower side of the data frame
df.tail(1)

      A        B                           C
1  Rony  Web dev  Nathhu lal private limited

In [17]:
#describe() function gives some basic statical information about the data
df.describe()

            A             B                           C
count       2             2                           2
unique      2             2                           2
top     Rahul  Data Science  Deen Dayal Private limited
freq        1             1                           1

In [33]:
#Cetagorical() function gives the output of unique data exist in the data frame
pd.Categorical(df['A'])

['Rahul', 'Rony']
Categories (2, object): ['Rahul', 'Rony']

In [34]:
#unique() function print the unique eliments from the data frame.
pd.unique(df['A'])

array(['Rahul', 'Rony'], dtype=object)

In [36]:
#for forming a series of a data
pd.Series(['jio','airtel'])

0       jio
1    airtel
dtype: object

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
#lets creat a data frame first.

In [7]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [45]:
data= [['Rahul','Data Science', 'Deen Dayal Private limited'], ['Rony','Web dev', 'Nathhu lal private limited'],['pooja','pyhton dev','Gjju mal private limited']]

In [46]:
df= pd.DataFrame(data, columns=['A','B','C'],index=[1,4,7])

In [47]:
df

       A             B                           C
1  Rahul  Data Science  Deen Dayal Private limited
4   Rony       Web dev  Nathhu lal private limited
7  pooja    pyhton dev    Gjju mal private limited

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.


For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [68]:
#creating a data frame name df1

df1= pd.DataFrame([12,131,31,5,454,66,45,53,34], columns=['Value'])

In [55]:
df1

   Value
0     12
1    131
2     31
3      5
4    454
5     66
6     45
7     53
8     34

In [69]:
#calculating the sum of first three elements
sum(df1['Value'][0:4])

179

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
df2= pd.DataFrame(['SABJI','DAL','SALT','WATER'], columns=['text'])

In [18]:
df2

    text
0  SABJI
1    DAL
2   SALT
3  WATER

In [45]:
#create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column
df2["Word_Count"]= df2['text'].apply(lambda x: len(x))

In [46]:
df2

    text  Word_Count
0  SABJI           5
1    DAL           3
2   SALT           4
3  WATER           5

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [51]:
df2.size
# size() function is returing the count of total elements in the Data frame.

8

In [53]:
df2.shape
# shape() is returning the number of rows and columns in a tuple.

(4, 2)

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q6. Which function of pandas do we use to read an excel file?

For reading a excel file in pandas we are using ; pandas read_excel

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [57]:
#creating a data frame.

df3= pd.DataFrame(['monica@gmail.com', 'raj@gmail.com','parakhar@gmail.com'], columns=['Email'])

In [59]:
df3

                Email
0    monica@gmail.com
1       raj@gmail.com
2  parakhar@gmail.com

In [61]:
#creating new column username
df3['Username']= df3['Email'].apply(lambda x: x.split('@')[0])

In [62]:
df3

                Email  Username
0    monica@gmail.com    monica
1       raj@gmail.com       raj
2  parakhar@gmail.com  parakhar

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:

- A B C
- 0 3 5 1
- 1 8 2 7
- 2 6 9 4
- 3 2 3 5
- 4 9 1 2

In [72]:
data=[[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]]



df4= pd.DataFrame(data,columns=['A','B','C'])

In [73]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [79]:
"""applying the condtion for selecting all rows where the value in column 'A' is greater than 5 and the 
value in column 'B' is less than 10."""

df4[(df4['A']>5) & (df4['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [80]:
df5= pd.DataFrame([21,313,33,232,321,434,363,131], columns=['Value'])

In [81]:
df5

   Value
0     21
1    313
2     33
3    232
4    321
5    434
6    363
7    131

In [83]:
# we can simply calculate the mean,median, and standard deviation of the values in the 'Values' column by using describe

df5.describe()

            Value
count    8.000000
mean   231.000000
std    154.347474
min     21.000000
25%    106.500000
50%    272.500000
75%    331.500000
max    434.000000

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [90]:
df6= pd.DataFrame(pd.date_range(start='2023-05-10' , end = '2023-05-25'), columns = ['Date'])

In [93]:
df6['Sales']=[12000,31000,80000,12500,22444,1500,24242,12000,14000,90000,22424,78000,7000,67677,69000,900]

In [94]:
df6

         Date  Sales
0  2023-05-10  12000
1  2023-05-11  31000
2  2023-05-12  80000
3  2023-05-13  12500
4  2023-05-14  22444
5  2023-05-15   1500
6  2023-05-16  24242
7  2023-05-17  12000
8  2023-05-18  14000
9  2023-05-19  90000
10 2023-05-20  22424
11 2023-05-21  78000
12 2023-05-22   7000
13 2023-05-23  67677
14 2023-05-24  69000
15 2023-05-25    900

In [97]:
df6['Moving Average'] = df6['Sales'].rolling(window=7).mean().round(2)

In [98]:
df6

         Date  Sales  Moving Average
0  2023-05-10  12000             NaN
1  2023-05-11  31000             NaN
2  2023-05-12  80000             NaN
3  2023-05-13  12500             NaN
4  2023-05-14  22444             NaN
5  2023-05-15   1500             NaN
6  2023-05-16  24242        26240.86
7  2023-05-17  12000        26240.86
8  2023-05-18  14000        23812.29
9  2023-05-19  90000        25240.86
10 2023-05-20  22424        26658.57
11 2023-05-21  78000        34595.14
12 2023-05-22   7000        35380.86
13 2023-05-23  67677        41585.86
14 2023-05-24  69000        49728.71
15 2023-05-25    900        47857.29

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date

- 0 2023-01-01
- 1 2023-01-02
- 2 2023-01-03
- 3 2023-01-04
- 4 2023-01-05

Your function should create the following DataFrame:Date Weekday

- 0 2023-01-01 Sunday
- 1 2023-01-02 Monday
- 2 2023-01-03 Tuesday
- 3 2023-01-04 Wednesday
- 4 2023-01-05 Thursday
 
The function should return the modified DataFrame.

In [102]:
df7=pd.DataFrame(pd.date_range(start= '2023-01-01', end= '2023-01-05'), columns=['Date'])

In [103]:
df7

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [111]:
df7['Weekday']= df7['Date'].dt.day_name()

In [112]:
df7

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [114]:
import pandas as pd
# where pd is a alias for calling the pandas